---
kind: property
id: P:Autodesk.Revit.DB.Electrical.AnalyticalEquipmentLoadData.LoadClassification
source: html/a961ae76-89b3-4212-a239-73eadf9f9566.htm
---
# Autodesk.Revit.DB.Electrical.AnalyticalEquipmentLoadData.LoadClassification Property

The load classification of analytical equipment load.

## Syntax (C#)
```csharp
public ElementId LoadClassification { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The id is not a load classification id .
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null